supperthomas/rt-thread/bsp/nrf5x/nrf5340/packages/nrfx-latest/libuarte/nrf_libuarte_drv.c
//    *p_en_task = nrfx_ppi_task_addr_group_enable_get(*p_ppi_group);
//    *p_dis_task = nrfx_ppi_task_addr_group_disable_get(*p_ppi_group);

//    return NRF_SUCCESS;
//}

/** @brief Disable and free PPI channel. */
//static void ppi_ch_free(nrf_ppi_channel_t * p_ch)
static void ppi_ch_free(uint8_t * p_ch)
{
    nrfx_err_t err;
    //err = nrfx_ppi_channel_disable(*p_ch);
    //ASSERT(err == NRFX_SUCCESS);
    //err = nrfx_ppi_channel_free(*p_ch);
    //ASSERT(err == NRFX_SUCCESS);
    //*p_ch = (nrf_ppi_channel_t)PPI_CH_NUM;
    
    err = nrfx_dppi_channel_disable(*p_ch);
    ASSERT(err == NRFX_SUCCESS);
    err = nrfx_dppi_channel_free(*p_ch);
    ASSERT(err == NRFX_SUCCESS);
    *p_ch = DPPI_CH_NUM;
   
}

/** @brief Disable and free PPI group. */
//static void ppi_group_free(nrf_ppi_channel_group_t * p_group)
//{
//    nrfx_err_t err;
//    err = nrfx_ppi_group_free(*p_group);
//    ASSERT(err == NRFX_SUCCESS);
//    *p_group = (nrf_ppi_channel_group_t)PPI_GROUP_NUM;

//}

/** @brief Free all channels. */
static void ppi_free(const nrf_libuarte_drv_t * const p_libuarte)
{
    PPI_CHANNEL_FOR_ALL(p_libuarte, ppi_ch_free);
   // PPI_GROUP_FOR_ALL(p_libuarte, ppi_group_free);
}

/** @brief Enable PPI channel. */
static void ppi_ch_enable(uint8_t * p_ch)
{
    nrfx_err_t err;
    //err = nrfx_ppi_channel_enable(*p_ch);
    err = nrfx_dppi_channel_enable(*p_ch);
    ASSERT(err == NRFX_SUCCESS);
}

/** @brief Disable PPI channel. */
static void ppi_ch_disable(uint8_t * p_ch)
{
    nrfx_err_t err;
    //err = nrfx_ppi_channel_disable(*p_ch);
    err = nrfx_dppi_channel_disable(*p_ch);
    ASSERT(err == NRFX_SUCCESS);
}

/** @brief Enable PPI channels for RX. */
static void rx_ppi_enable(const nrf_libuarte_drv_t * const p_libuarte)
{
//PPI_CHANNEL_FOR_M_N(p_libuarte, 0, NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX, ppi_ch_enable);
    nrfx_err_t err;
    
     for (int i = 0; i < NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX; i++) 
        { 
            if (p_libuarte->ctrl_blk->ppi_channels[i] < DPPI_CH_NUM) 
            {     
              //err = nrfx_ppi_channel_enable(*p_ch);
              err = nrfx_dppi_channel_enable(p_libuarte->ctrl_blk->ppi_channels[i]);
              ASSERT(err == NRFX_SUCCESS); 
          } 
        }
}

/** @brief Disable PPI channels for RX. */
static void rx_ppi_disable(const nrf_libuarte_drv_t * const p_libuarte)
{
    //PPI_CHANNEL_FOR_M_N(p_libuarte, 0, NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX, ppi_ch_disable);
        nrfx_err_t err;
    
     for (int i = 0; i < NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX; i++) 
        { 
            if (p_libuarte->ctrl_blk->ppi_channels[i] < DPPI_CH_NUM) 
            {     
              //err = nrfx_ppi_channel_enable(*p_ch);
              err = nrfx_dppi_channel_disable(p_libuarte->ctrl_blk->ppi_channels[i]);
              ASSERT(err == NRFX_SUCCESS); 
          } 
        }
}

/** @brief Enable PPI channels for TX. */
static void tx_ppi_enable(const nrf_libuarte_drv_t * const p_libuarte)
{
    //PPI_CHANNEL_FOR_M_N(p_libuarte, NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX,
    //                    NRF_LIBUARTE_DRV_PPI_CH_MAX, ppi_ch_enable);
      nrfx_err_t err;
    
     for (int i = NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX; i < NRF_LIBUARTE_DRV_PPI_CH_MAX; i++) 
        { 
            if (p_libuarte->ctrl_blk->ppi_channels[i] < DPPI_CH_NUM) 
            {     
              //err = nrfx_ppi_channel_enable(*p_ch);
              err = nrfx_dppi_channel_enable(p_libuarte->ctrl_blk->ppi_channels[i]);
              ASSERT(err == NRFX_SUCCESS); 
          } 
        }
}

/** @brief Disable PPI channels for TX. */
static void tx_ppi_disable(const nrf_libuarte_drv_t * const p_libuarte)
{nrfx_err_t err;
   // PPI_CHANNEL_FOR_M_N(p_libuarte, NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX,
   //                     NRF_LIBUARTE_DRV_PPI_CH_MAX, ppi_ch_disable);
   for (int i = NRF_LIBUARTE_DRV_PPI_CH_RX_GROUP_MAX; i < NRF_LIBUARTE_DRV_PPI_CH_MAX; i++) 
        { 
            if (p_libuarte->ctrl_blk->ppi_channels[i] < DPPI_CH_NUM) 
            {     
              //err = nrfx_ppi_channel_enable(*p_ch);
              err = nrfx_dppi_channel_disable(p_libuarte->ctrl_blk->ppi_channels[i]);
              ASSERT(err == NRFX_SUCCESS); 
          } 
        }
}

static ret_code_t ppi_configure(const nrf_libuarte_drv_t * const p_libuarte,
                                nrf_libuarte_drv_config_t * p_config)
{
    ret_code_t ret;
    //uint32_t gr0_en_task = 0;
    //uint32_t gr0_dis_task = 0;
    //uint32_t gr1_en_task = 0;
    //uint32_t gr1_dis_task = 0;

    for (int i = 0; i < NRF_LIBUARTE_DRV_PPI_CH_MAX; i++)
    {
        /* set to invalid value */
        //p_libuarte->ctrl_blk->ppi_channels[i] = (nrf_ppi_channel_t)PPI_CH_NUM;
        p_libuarte->ctrl_blk->ppi_channels[i] = DPPI_CH_NUM;
    }

    for (int i = 0; i < NRF_LIBUARTE_DRV_PPI_GROUP_MAX; i++)
    {
        /* set to invalid value */
       // p_libuarte->ctrl_blk->ppi_groups[i] = (nrf_ppi_channel_group_t)PPI_GROUP_NUM;
       //p_libuarte->ctrl_blk->ppi_groups[i] = (nrf_ppi_channel_group_t)PPI_GROUP_NUM;
    }

    if (MAX_DMA_XFER_LEN < UINT16_MAX)
    {
        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDTX_STARTTX],
        //        nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDTX),
        //        nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTTX),
        //        0);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}
          ret = nrfx_dppi_channel_alloc(&p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDTX_STARTTX]);
          if (ret != NRFX_SUCCESS)
          {
               //we don't free already allocated channels, system is wrongly configured.
               goto complete_config;
          }
          nrf_uarte_publish_set(p_libuarte->uarte,NRF_UARTE_EVENT_ENDTX,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDTX_STARTTX]);
          nrf_uarte_subscribe_set(p_libuarte->uarte,NRF_UARTE_TASK_STARTTX,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDTX_STARTTX]);

