supperthomas/rt-thread/bsp/nrf5x/nrf5340/packages/nrfx-latest/libuarte/nrf_libuarte_drv.c
    }

    //ret = ppi_channel_configure(
    //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RXRDY_TIMER_COUNT],
    //        nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_RXDRDY),
    //        nrfx_timer_task_address_get(&p_libuarte->timer, NRF_TIMER_TASK_COUNT),
    //        0);
    //if (ret != NRF_SUCCESS)
    //{
    //    goto complete_config;
    //}
     //ret = nrfx_dppi_channel_alloc(&p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RXRDY_TIMER_COUNT]);
     //     if (ret != NRFX_SUCCESS)
     //     {
     //          //we don't free already allocated channels, system is wrongly configured.
     //          goto complete_config;
     //     }
     //     nrf_uarte_publish_set(p_libuarte->uarte,NRF_UARTE_EVENT_RXDRDY,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RXRDY_TIMER_COUNT]);
     //     nrf_timer_subscribe_set(p_libuarte->timer.p_reg,NRF_TIMER_TASK_COUNT,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RXRDY_TIMER_COUNT]);

    //ret = ppi_channel_configure(
    //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX],
    //        nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDRX),
    //        nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTRX),
    //        nrfx_timer_capture_task_address_get(&p_libuarte->timer, 0));
    //if (ret != NRF_SUCCESS)
    //{
    //    goto complete_config;
    //}
      ret = nrfx_dppi_channel_alloc(&p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX]);
          if (ret != NRFX_SUCCESS)
          {
               //we don't free already allocated channels, system is wrongly configured.
               goto complete_config;
          }
          nrf_uarte_publish_set(p_libuarte->uarte,NRF_UARTE_EVENT_ENDRX,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX]);
          nrf_uarte_subscribe_set(p_libuarte->uarte,NRF_UARTE_TASK_STARTRX,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX]);
          nrf_timer_subscribe_set(p_libuarte->timer.p_reg,NRF_TIMER_TASK_CAPTURE0,p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX]);



    if (p_config->endrx_evt && p_config->rxdone_tsk)
    {
        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_EXT_TSK],
        //        nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_ENDRX),
        //        nrfx_timer_capture_task_address_get(&p_libuarte->timer, 0),
        //        p_config->rxdone_tsk);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}

        //ret = ppi_group_configure(&p_libuarte->ctrl_blk->ppi_groups[NRF_LIBUARTE_DRV_PPI_GROUP_ENDRX_STARTRX],
        //        p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_STARTRX],
        //        &gr0_en_task, &gr0_dis_task, true);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}

        //ret = ppi_group_configure(&p_libuarte->ctrl_blk->ppi_groups[NRF_LIBUARTE_DRV_PPI_GROUP_ENDRX_EXT_RXDONE_TSK],
        //        p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_ENDRX_EXT_TSK],
        //        &gr1_en_task, &gr1_dis_task, false);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}

        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_EXT_STOP_STOPRX],
        //        p_config->endrx_evt,
        //        nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STOPRX),
        //        nrfx_timer_capture_task_address_get(&p_libuarte->timer, 1));
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}

        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_EXT_STOP_GROUPS_EN],
        //        p_config->endrx_evt,
        //        gr0_dis_task,
        //        gr1_en_task);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}
    }

   // if (p_config->rxstarted_tsk || gr1_dis_task)
    {
        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RXSTARTED_EXT_TSK],
        //        nrf_uarte_event_address_get(p_libuarte->uarte, NRF_UARTE_EVENT_RXSTARTED),
        //        gr1_dis_task ? gr1_dis_task : p_config->rxstarted_tsk,
        //        gr1_dis_task ? p_config->rxstarted_tsk : 0);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}
    }

    if (p_config->startrx_evt)
    {
        //ret = ppi_channel_configure(
        //        &p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_EXT_TRIGGER_STARTRX_EN_ENDRX_STARTX],
        //        p_config->startrx_evt,
        //        nrf_uarte_task_address_get(p_libuarte->uarte, NRF_UARTE_TASK_STARTRX),
        //        gr0_en_task);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}
    }

    if (p_config->endrx_evt)
    {

    }

    if (LIBUARTE_DRV_WITH_HWFC && (p_config->rts_pin != NRF_UARTE_PSEL_DISCONNECTED))
    {
        //ret = ppi_channel_configure(&p_libuarte->ctrl_blk->ppi_channels[NRF_LIBUARTE_DRV_PPI_CH_RTS_PIN],
        //        nrfx_timer_compare_event_address_get(&p_libuarte->timer, 2),
        //        nrfx_gpiote_set_task_addr_get(p_config->rts_pin),
        //        0);
        //if (ret != NRF_SUCCESS)
        //{
        //    goto complete_config;
        //}
    }

complete_config:
    if (ret == NRF_SUCCESS)
    {
        return ret;
    }

    ppi_free(p_libuarte);

    return ret;
}

void tmr_evt_handler(nrf_timer_event_t event_type, void * p_context)
{
    UNUSED_PARAMETER(event_type);
    UNUSED_PARAMETER(p_context);
}

ret_code_t nrf_libuarte_drv_init(const nrf_libuarte_drv_t * const p_libuarte,
                             nrf_libuarte_drv_config_t * p_config,
                             nrf_libuarte_drv_evt_handler_t evt_handler,
                             void * context)
{
    ret_code_t ret;
    IRQn_Type irqn = nrfx_get_irq_number(p_libuarte->uarte);
	nrf_uarte_config_t cfg;

